import styled from "styled-components";
import { PropsWithChildren } from "react";
import { flexbox, FlexboxProps } from "styled-system";
import { media } from "~common/custom-media";
import { useNavigate, useParams } from "react-router-dom";
import { ROUTES } from "~routes";

export const Container = styled.div<PropsWithChildren<FlexboxProps>>`
  display: flex;
  flex-direction: column;
  width: 100%;
  max-width: 700px;
  padding: 50px 0;
  margin: 0 auto;
  ${media.lessThan("pc")`
    max-width: 730px;
      padding: 40px 0;
  `}
  ${media.lessThan("tablet")`
    max-width: 350px;
  `}
  ${flexbox}
`;

const H2 = styled.h2`
  margin-top: 30px;
  margin-bottom: 10px;
`;

const H3 = styled.h3`
  margin-bottom: 30px;
  cursor: pointer;
  :hover {
    color: #ffe600;
  }
`;

const Paragraph = styled.p`
  line-height: 1.7;
`;

const offers = [
  {
    id: "1",
    title: "ФОП ПОДОВАЛОВ АНДРІЙ ОЛЕКСАНДРОВИЧ",
    text: (
      <>
        <H2>ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА) КУПІВЛІ-ПРОДАЖУ ТОВАРІВ</H2>
        <Paragraph>
          Цей договір між{" "}
          <b>ФІЗИЧНОЮ ОСОБОЮ - ПІДПРИЄМЦЕМ Подовалов Андрій Олександрович</b>,
          іменованим надалі <b>«Продавець»</b>, ІПН 2714122896, статус якого як
          підприємця підтверджується Випискою з Єдиного державного реєстру
          юридичних осіб, фізичних осіб - підприємців та громадських формувань
          (дата та номер запису в реєстрі: 01.09.2025р.,
          <br />№ 2010350000000859155), з одного боку, і будь-якою дієздатною
          фізичною особою, яка прийняла (акцептувала) дану пропозицію-оферту,
          далі <b>«Покупець»</b>, з іншого боку, є договором купівлі-продажу і
          визначає основні умови замовлення, придбання та доставки товарів
          покупцям (далі – «Договір»).
          <br />
          <br />
        </Paragraph>

        <H2>1. Визначення термінів</H2>
        <Paragraph>
          1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція Продавця,
          адресована невизначеному колу фізичних, дієздатних осіб, укласти з
          Продавцем договір купівлі-продажу суші, ролів або інших страв (далі
          «товар») дистанційним способом на умовах, що містяться в цій Оферті.
          <br />
          <br />
          1.2. Замовлення Покупця - рішення Покупця замовити конкретний товар
          (далі «Товар») з переліку, представленого на сайті (розміщеному за
          веб-адресою https:// emojisushi.com.ua /) або в результаті дзвінка
          Продавцю (його представнику) за телефоном. Право на використання
          вказаного сайт, у Продавця є відповідно до Договору №100719п2 про
          надання послуг розробки і поставки програмної продукції від
          10.07.2019р.
          <br />
          <br />
        </Paragraph>

        <H2>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</H2>
        <Paragraph>
          2.1. Наведена нижче інформація є офіційною пропозицією (офертою)
          Продавця будь-якій дієздатній фізичній особі (Покупцю) укласти даний
          договір купівлі-продажу товарів. Договір є публічним, тобто відповідно
          до статті 633 Цивільного кодексу України його умови однакові для всіх
          покупців.
          <br />
          <br />
          2.2. Згідно зі статтею 642 Цивільного кодексу України повним і
          беззастережним прийняттям умов даної пропозиції (оферти), що
          підтверджує укладення Договору купівлі-продажу товарів на
          запропонованих нижче умовах, є факт оформлення Замовлення Покупця.
          <br />
          <br />
          2.3. Оформленням Замовлення Покупець підтверджує узгодження і
          безумовне прийняття ним умов цієї пропозиції (Оферти).
          <br />
          <br />
          2.4. Укладаючи Договір (тобто акцептуючи умови даної пропозиції
          (Оферти) шляхом оформлення Замовлення), Покупець підтверджує, що:
          <br />
          <br />
          2.4.1. Він цілком і повністю ознайомлений, і згоден з умовами цієї
          пропозиції (Оферти).
          <br />
          <br />
          2.4.2. Він дає дозвіл на збір, обробку та передачу персональних даних
          на умовах, визначених нижче в застереженні щодо збору, обробки та
          передачі персональних даних дозвіл на обробку персональних даних діє
          протягом усього терміну дії Договору, а також протягом необмеженого
          терміну після закінчення його дії. Дозвіл на обробку персональних
          даних діє протягом усього терміну дії Договору, а також протягом
          необмеженого терміну після закінчення його дії. Крім цього, укладенням
          Договору
          <br />
          Покупець підтверджує, що він повідомлений (без додаткового
          повідомлення) про права, встановлені Законом України "Про захист
          персональних даних", про цілі збору даних, а також про те, що його
          персональні дані передаються Продавцю з метою можливості виконання
          умов цього Договору, можливості проведення взаєморозрахунків, а також
          для отримання рахунків та інших документів.
          <br />
          Покупець також погоджується з тим, що Продавець має право надавати
          доступ та передавати його персональні дані третім особам без будь-яких
          додаткових повідомлень Покупця, не змінюючи при цьому мета обробки
          персональних даних. Обсяг прав Покупця, як суб'єкта персональних даних
          відповідно до Закону України "Про захист персональних даних" йому
          відомий і зрозумілий.
          <br />
          <br />
        </Paragraph>
        <H2>3. ЦІНА ТОВАРУ</H2>
        <Paragraph>
          3.1. Ціна на кожну позицію товару вказана на сайті, розміщеному за
          веб-адресою https://emojisushi.com.ua/
          <br />
          <br />
          3.2. Продавець має право в односторонньому порядку змінити ціну на
          будь-яку позицію товару.
          <br />
          <br />
          3.3. Покупець має право підтвердити або анулювати Замовлення на
          придбання Товару, якщо ціна змінена Продавцем після оформлення
          Замовлення.
          <br />
          <br />
          3.4. Зміна Продавцем ціни на оплачений Покупцем Товар не допускається.
          <br />
          <br />
          3.5. Вартість доставки Товару, якщо вона необхідна Покупцю і допустима
          згідно з умовами доставки товару, розміщеними на зазначеному вище
          сайті в розділі «Доставка і повернення», є безкоштовною.
          <br />
          <br />
          3.6. Зобов'язання Покупця по оплаті Товару вважаються виконаними з
          моменту надходження Продавцю коштів в оплату замовленого Товару.
          <br />
          <br />
          3.7. Розрахунки між Продавцем і Покупцем за Товар здійснюються
          способами, зазначеними на зазначеному вище сайті в розділі «Доставка і
          повернення».
          <br />
          <br />
        </Paragraph>

        <H2>4. ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</H2>
        <Paragraph>
          4.1. Замовлення Товару здійснюється Покупцем відповідно до п. 1.2
          Договору способами, зазначеними на зазначеному вище сайті в розділі
          «Доставка і повернення».
          <br />
          <br />
          4.2. У разі ненадання Покупцем при здійсненні замовлення Товару
          необхідної інформації, Продавець не несе відповідальності за виниклі в
          зв'язку з цим непорозуміння і труднощі по виконанню ним своїх
          зобов'язань за Договором.
          <br />
          <br />
          4.3. Покупець несе відповідальність за достовірність інформації,
          наданої ним при оформленні Замовлення.
          <br />
          <br />
          4.4. Договір між Продавцем і Покупцем вважається укладеним з моменту
          оформлення замовлення Покупця згідно п. 1.2 Договору.
          <br />
          <br />
        </Paragraph>

        <H2>5. ДОСТАВКА І ПЕРЕДАЧА ТОВАРУ ПОКУПЦЮ</H2>
        <Paragraph>
          5.1. Порядок і умови доставки товарів вказані на зазначеному вище
          сайті в розділі «Доставка і повернення». Умова про доставку Товару,
          якщо така необхідна Покупцю, узгоджується сторонами при оформленні
          замовлення Покупця.
          <br />
          <br />
          5.2. Самовивезення Товару. Якщо умову про доставку Товару не було
          погоджено при оформленні замовлення, Покупець забирає оплачений Товар
          в торговому магазині Продавця, визначеному Покупцем при оформленні
          замовлення, відповідно до режиму роботи магазину.
          <br />
          <br />
          5.3. Право власності та ризик випадкової втрати або пошкодження Товару
          переходить до Покупця (в т.ч. в особі його представника) з моменту
          отримання останнім Товару.
          <br />
          <br />
          5.4. Доставка Товару здійснюється відповідно до погоджених умов
          доставки, за рахунок Продавця, його представниками або із залученням
          третіх осіб (за допомогою кур'єрської доставки).
          <br />
          <br />
          5.5. При отриманні Товару Покупець повинен у присутності представника
          Продавця / кур'єра перевірити відповідність Товару замовленню.
          <br />
          <br />
        </Paragraph>

        <H2>6. ПОВЕРНЕННЯ ТОВАРУ</H2>
        <Paragraph>
          6.1. Покупець має право відмовитися від Товару в будь-який час до його
          передачі, а після передачі Товару - в порядку і на умовах, визначених
          Законом України «Про захист прав споживачів».
          <br />
          <br />
          6.2. З огляду на те, що Покупець придбає продовольчий Товар,
          відповідно до закону України «Про захист прав споживачів» він не має
          права відмовитися від Товару належної якості.
          <br />
          <br />
          6.3. Повернення Товару, у випадках, передбачених законом та цим
          Договором, здійснюється за адресою, вказаною на зазначеному вище сайті
          в розділі «Доставка і повернення».
          <br />
          <br />
          6.4. При відмові Покупця від Товару неналежної якості Продавець
          повертає кошти в розмірі вартості такого Товару.
          <br />
          <br />
        </Paragraph>

        <H2>7. ВІДПОВІДАЛЬНІСТЬ СТОРІН</H2>
        <Paragraph>
          7.1. Продавець не несе відповідальності за неналежне, несвоєчасне
          виконання Замовлення та інших своїх зобов'язань в разі надання
          Покупцем при оформленні Замовлення недостовірної або помилкової
          інформації.
          <br />
          <br />
          7.2. Продавець і Покупець несуть відповідальність за виконання своїх
          зобов'язань відповідно до чинного законодавства України і положень
          цього Договору.
          <br />
          <br />
          7.3. Продавець або Покупець звільняються від відповідальності за повне
          або часткове невиконання своїх зобов'язань, якщо таке невиконання
          стало наслідком форс-мажорних обставин, таких як: війна або військові
          дії, землетрус, повінь, пожежа та інші стихійні лиха, що виникли
          незалежно від волі Продавця і / або Покупця після укладення цього
          Договору. Сторона, яка не може виконати свої зобов'язання, зобов'язана
          негайно повідомити про це іншу Сторону з наданням документального
          підтвердження відповідних обставин.
          <br />
          <br />
        </Paragraph>
        <H2>АДРЕСА ТА РЕКВІЗИТИ ПРОДАВЦЯ:</H2>
        <Paragraph>
          <b>ФІЗИЧНА ОСОБА - ПІДПРИЄМЕЦЬ ПОДОВАЛОВ АНДРІЙ ОЛЕКСАНДРОВИЧ</b>
          <br />
          Україна, 65098, Одеська обл., місто Одеса, вул. Путьова, будинок 44,
          квартира 6
          <br />
          ІПН 2714122896
          <br />
          <br />
          Код в ЄДР: Дата запису: 01.09.2025р.
          <br />
          Номер запису 2010350000000859155
          <br />
          <br />
          Р/р: АТ КБ "ПРИВАТБАНК",
          <br />
          UA563052990000026004044922864
          <br />
          <br />
          Т/ф: +38(077)-221-04-47
          <br />
          e-mail: andreiemoji1212@gmail.com
        </Paragraph>
      </>
    ),
  },
  {
    id: "2",
    title: "ФОП БЕЖЕНАР АННА-ВІКТОРІЯ ЄВГЕНІВНА",
    text: (
      <>
        <H2>ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА) КУПІВЛІ-ПРОДАЖУ ТОВАРІВ</H2>
        <Paragraph>
          Цей договір між{" "}
          <b>ФІЗИЧНОЮ ОСОБОЮ - ПІДПРИЄМЦЕМ БЕЖЕНАР АННА-ВІКТОРІЯ ЄВГЕНІВНА</b>,
          іменованим надалі <b>«Продавець»</b>, ІПН 3792607044, статус якого як
          підприємця підтверджується Випискою з Єдиного державного реєстру
          юридичних осіб, фізичних осіб - підприємців та громадських формувань
          (дата та номер запису в реєстрі: 31.07.2025р.,
          <br />№ 2010350000000839369), з одного боку, і будь-якою дієздатною
          фізичною особою, яка прийняла (акцептувала) дану пропозицію-оферту,
          далі <b>«Покупець»</b>, з іншого боку, є договором купівлі-продажу і
          визначає основні умови замовлення, придбання та доставки товарів
          покупцям (далі – «Договір»).
          <br />
          <br />
        </Paragraph>

        <H2>1. Визначення термінів</H2>
        <Paragraph>
          1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція Продавця,
          адресована невизначеному колу фізичних, дієздатних осіб, укласти з
          Продавцем договір купівлі-продажу суші, ролів або інших страв (далі
          «товар») дистанційним способом на умовах, що містяться в цій Оферті.
          <br />
          <br />
          1.2. Замовлення Покупця - рішення Покупця замовити конкретний товар
          (далі «Товар») з переліку, представленого на сайті (розміщеному за
          веб-адресою https://emojisushi.com.ua/) або в результаті дзвінка
          Продавцю (його представнику) за телефоном. Право на використання
          вказаного сайт, у Продавця є відповідно до Договору №100719п2 про
          надання послуг розробки і поставки програмної продукції від
          10.07.2019р.
          <br />
          <br />
        </Paragraph>

        <H2>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</H2>
        <Paragraph>
          2.1. Наведена нижче інформація є офіційною пропозицією (офертою)
          Продавця будь-якій дієздатній фізичній особі (Покупцю) укласти даний
          договір купівлі-продажу товарів. Договір є публічним, тобто відповідно
          до статті 633 Цивільного кодексу України його умови однакові для всіх
          покупців.
          <br />
          <br />
          2.2. Згідно зі статтею 642 Цивільного кодексу України повним і
          беззастережним прийняттям умов даної пропозиції (оферти), що
          підтверджує укладення Договору купівлі-продажу товарів на
          запропонованих нижче умовах, є факт оформлення Замовлення Покупця.
          <br />
          <br />
          2.3. Оформленням Замовлення Покупець підтверджує узгодження і
          безумовне прийняття ним умов цієї пропозиції (Оферти).
          <br />
          <br />
          2.4. Укладаючи Договір (тобто акцептуючи умови даної пропозиції
          (Оферти) шляхом оформлення Замовлення), Покупець підтверджує, що:
          <br />
          <br />
          2.4.1. Він цілком і повністю ознайомлений, і згоден з умовами цієї
          пропозиції (Оферти).
          <br />
          <br />
          2.4.2. Він дає дозвіл на збір, обробку та передачу персональних даних
          на умовах, визначених нижче в застереженні щодо збору, обробки та
          передачі персональних даних дозвіл на обробку персональних даних діє
          протягом усього терміну дії Договору, а також протягом необмеженого
          терміну після закінчення його дії. Дозвіл на обробку персональних
          даних діє протягом усього терміну дії Договору, а також протягом
          необмеженого терміну після закінчення його дії. Крім цього, укладенням
          Договору
          <br />
          Покупець підтверджує, що він повідомлений (без додаткового
          повідомлення) про права, встановлені Законом України "Про захист
          персональних даних", про цілі збору даних, а також про те, що його
          персональні дані передаються Продавцю з метою можливості виконання
          умов цього Договору, можливості проведення взаєморозрахунків, а також
          для отримання рахунків та інших документів.
          <br />
          Покупець також погоджується з тим, що Продавець має право надавати
          доступ та передавати його персональні дані третім особам без будь-яких
          додаткових повідомлень Покупця, не змінюючи при цьому мета обробки
          персональних даних. Обсяг прав Покупця, як суб'єкта персональних даних
          відповідно до Закону України "Про захист персональних даних" йому
          відомий і зрозумілий.
          <br />
          <br />
        </Paragraph>
        <H2>3. ЦІНА ТОВАРУ</H2>
        <Paragraph>
          3.1. Ціна на кожну позицію товару вказана на сайті, розміщеному за
          веб-адресою https://emojisushi.com.ua/
          <br />
          <br />
          3.2. Продавець має право в односторонньому порядку змінити ціну на
          будь-яку позицію товару.
          <br />
          <br />
          3.3. Покупець має право підтвердити або анулювати Замовлення на
          придбання Товару, якщо ціна змінена Продавцем після оформлення
          Замовлення.
          <br />
          <br />
          3.4. Зміна Продавцем ціни на оплачений Покупцем Товар не допускається.
          <br />
          <br />
          3.5. Вартість доставки Товару, якщо вона необхідна Покупцю і допустима
          згідно з умовами доставки товару, розміщеними на зазначеному вище
          сайті в розділі «Доставка і повернення», є безкоштовною.
          <br />
          <br />
          3.6. Зобов'язання Покупця по оплаті Товару вважаються виконаними з
          моменту надходження Продавцю коштів в оплату замовленого Товару.
          <br />
          <br />
          3.7. Розрахунки між Продавцем і Покупцем за Товар здійснюються
          способами, зазначеними на зазначеному вище сайті в розділі «Доставка і
          повернення».
          <br />
          <br />
        </Paragraph>

        <H2>4. ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</H2>
        <Paragraph>
          4.1. Замовлення Товару здійснюється Покупцем відповідно до п. 1.2
          Договору способами, зазначеними на зазначеному вище сайті в розділі
          «Доставка і повернення».
          <br />
          <br />
          4.2. У разі ненадання Покупцем при здійсненні замовлення Товару
          необхідної інформації, Продавець не несе відповідальності за виниклі в
          зв'язку з цим непорозуміння і труднощі по виконанню ним своїх
          зобов'язань за Договором.
          <br />
          <br />
          4.3. Покупець несе відповідальність за достовірність інформації,
          наданої ним при оформленні Замовлення.
          <br />
          <br />
          4.4. Договір між Продавцем і Покупцем вважається укладеним з моменту
          оформлення замовлення Покупця згідно п. 1.2 Договору.
          <br />
          <br />
        </Paragraph>

        <H2>5. ДОСТАВКА І ПЕРЕДАЧА ТОВАРУ ПОКУПЦЮ</H2>
        <Paragraph>
          5.1. Порядок і умови доставки товарів вказані на зазначеному вище
          сайті в розділі «Доставка і повернення». Умова про доставку Товару,
          якщо така необхідна Покупцю, узгоджується сторонами при оформленні
          замовлення Покупця.
          <br />
          <br />
          5.2. Самовивезення Товару. Якщо умову про доставку Товару не було
          погоджено при оформленні замовлення, Покупець забирає оплачений Товар
          в торговому магазині Продавця, визначеному Покупцем при оформленні
          замовлення, відповідно до режиму роботи магазину.
          <br />
          <br />
          5.3. Право власності та ризик випадкової втрати або пошкодження Товару
          переходить до Покупця (в т.ч. в особі його представника) з моменту
          отримання останнім Товару.
          <br />
          <br />
          5.4. Доставка Товару здійснюється відповідно до погоджених умов
          доставки, за рахунок Продавця, його представниками або із залученням
          третіх осіб (за допомогою кур'єрської доставки).
          <br />
          <br />
          5.5. При отриманні Товару Покупець повинен у присутності представника
          Продавця / кур'єра перевірити відповідність Товару замовленню.
          <br />
          <br />
        </Paragraph>

        <H2>6. ПОВЕРНЕННЯ ТОВАРУ</H2>
        <Paragraph>
          6.1. Покупець має право відмовитися від Товару в будь-який час до його
          передачі, а після передачі Товару - в порядку і на умовах, визначених
          Законом України «Про захист прав споживачів».
          <br />
          <br />
          6.2. З огляду на те, що Покупець придбає продовольчий Товар,
          відповідно до закону України «Про захист прав споживачів» він не має
          права відмовитися від Товару належної якості.
          <br />
          <br />
          6.3. Повернення Товару, у випадках, передбачених законом та цим
          Договором, здійснюється за адресою, вказаною на зазначеному вище сайті
          в розділі «Доставка і повернення».
          <br />
          <br />
          6.4. При відмові Покупця від Товару неналежної якості Продавець
          повертає кошти в розмірі вартості такого Товару.
          <br />
          <br />
        </Paragraph>

        <H2>7. ВІДПОВІДАЛЬНІСТЬ СТОРІН</H2>
        <Paragraph>
          7.1. Продавець не несе відповідальності за неналежне, несвоєчасне
          виконання Замовлення та інших своїх зобов'язань в разі надання
          Покупцем при оформленні Замовлення недостовірної або помилкової
          інформації.
          <br />
          <br />
          7.2. Продавець і Покупець несуть відповідальність за виконання своїх
          зобов'язань відповідно до чинного законодавства України і положень
          цього Договору.
          <br />
          <br />
          7.3. Продавець або Покупець звільняються від відповідальності за повне
          або часткове невиконання своїх зобов'язань, якщо таке невиконання
          стало наслідком форс-мажорних обставин, таких як: війна або військові
          дії, землетрус, повінь, пожежа та інші стихійні лиха, що виникли
          незалежно від волі Продавця і / або Покупця після укладення цього
          Договору. Сторона, яка не може виконати свої зобов'язання, зобов'язана
          негайно повідомити про це іншу Сторону з наданням документального
          підтвердження відповідних обставин.
          <br />
          <br />
        </Paragraph>
        <H2>АДРЕСА ТА РЕКВІЗИТИ ПРОДАВЦЯ:</H2>
        <Paragraph>
          <b>ФІЗИЧНА ОСОБА - ПІДПРИЄМЕЦЬ БЕЖЕНАР АННА-ВІКТОРІЯ ЄВГЕНІВНА</b>
          <br />
          Україна, 65104, Одеська обл., місто Одеса, вул. Корольова академіка,
          будинок 78, квартира 66
          <br />
          ІПН 3792607044
          <br />
          <br />
          Код в ЄДР: Дата запису: 31.07.2025р.
          <br />
          Номер запису 2010350000000839369
          <br />
          <br />
          Р/р: АТ КБ "ПРИВАТБАНК",
          <br />
          UA223052990000026001024928580
          <br />
          <br />
          Т/ф: +38(077)-710-47-88
          <br />
          e-mail: annaviktoria577@gmail.com
        </Paragraph>
      </>
    ),
  },
];

export const PublicOfferPage = () => {
  const { id } = useParams();
  const navigate = useNavigate();

  let text = offers.find((el) => el.id == id)?.text;
  if (id && !text) {
    navigate(ROUTES.PUBLIC_OFFER.path);
  }

  return (
    <Container>
      {text ? (
        text
      ) : (
        <>
          {offers.map((el) => (
            <H3
              key={el.id}
              onClick={() => navigate(`${ROUTES.PUBLIC_OFFER.path}/${el.id}`)}
            >
              {el.title}
            </H3>
          ))}
        </>
      )}
    </Container>
  );
};

export const Component = PublicOfferPage;
